{
    "assessment":  "\u003cbr/\u003eOnline Quizzes \u0026 10% \u0026 Six online quizzes over semester; best five count for 2% each. \u003cbr/\u003eAssignment 1 \u0026 20% \u0026 Program / report on algorithmic analysis and graph algorithms. \u003cbr/\u003eAssignment 2 \u0026 20% \u0026 Program / report on dynamic programming. \u003cbr/\u003eFinal Exam \u0026 50% \u0026 Closed book (one A4 sheet allowed). \u003cbr/\u003e",
    "review":  "\u003cbr/\u003eThis course follows on from COMP3506, examining algorithms and data structures. Specifically, the course covers algorithmic analysis, recurrences / divide-and-conquer algorithms, graph algorithms, dynamic programming, greedy programming, amortised analysis, complexity theory and randomised algorithms.\u003cbr/\u003e\u003cbr/\u003eThe lectures are worth attending as they go over the material in depth and include examples done on the board (which don\u0027t appear on recordings). In addition, since the content can be quite theoretical, being able to see examples done and ask questions is useful to aid understanding.The online quizzes involve multiple choice questions and are generally easy, but some questions are unclear and confusingly worded.\u003cbr/\u003e\u003cbr/\u003eThe assignments are quite involved, requiring both an implementation and a report component. The programming component requires students to come up with an algorithm to efficiently solve a problem, and then justify the algorithm and analysis its complexity in the report. Generally the actual implementation is easy, but designing the algorithm and getting it to `click\u0027 in your head can be tough. Allow time to think the problem over for a few days before attempting to actually write code.\u003cbr/\u003e\u003cbr/\u003eThe final exam is closed book with one double-sided A4 sheet of paper allowed. The exam follows the same structure year to year, so past papers are useful study, as are the lecture notes and tutorial sheets. The exam is difficult, requiring students to come up with algorithms to solve graph problems, dynamic programming problems and prove a problem\u0027s NP-Completeness within the exam.\u003cbr/\u003e\u003cbr/\u003eOverall, this course is one that students may find difficult, but its content is incredibly useful, to the point that the content is really mandatory knowledge for anyone practising computer science or software engineering at a professional level. In addition, the course is well taught despite its difficulty, and knowing the content will help you in many other courses, and as such I highly recommend this course.\u003cbr/\u003e",
    "coordinator":  "Dr Larissa Meinicke (l.meinicke@uq.edu.au)",
    "contact":  "2L",
    "score":  "5",
    "code":  "COMP4500",
    "title":  "Advanced Algorithms \u0026amp; Data Structures",
    "preparation":  "\u003cbr/\u003eitem Refresh your knowledge of data structures -- this course covers them more abstractly than COMP3506 (e.g. less focus on things like specific kinds of self-balancing trees)\u003cbr/\u003eitem Familiarise yourself with common graph algorithms (e.g. BFS, DFS, Dijkstra, Prim\u0027s algorithm)\u003cbr/\u003eitem Do background reading on complexity theory, $ P $, $ NP $, $ NP $-Completeness etc.\u003cbr/\u003e",
    "prereq":  "COMP3506"
}
