{
    "assessment":  "\u003cbr/\u003eTutorials \u0026 20% \u0026 Randomly picked presentations each week, and a paper prototype \u003cbr/\u003ePracticals \u0026 30% \u0026 Two exams: one on HTML/CSS, and one on jQuery \u003cbr/\u003eProject \u0026 25% \u0026 A fully implemented website in HTML/CSS, plus documentation \u003cbr/\u003eFinal Exam \u0026 25% \u0026 Closed book final exam on lecture material \u003cbr/\u003e",
    "review":  "\u003cbr/\u003eThis course will teach you all you need to know to create a basic website with HTMl, CSS and JavaScript. While this course has become more theoretical recently, it still a very practical course. \u003cbr/\u003e\u003cbr/\u003eYou will be required to prepare a speech each week on the week\u0027s topic in the lecture. The tutor will randomly pick a group to do their speech. Be sure to know the topic well in case you are picked. \u003cbr/\u003e\u003cbr/\u003eThe prac class will have a set of activities which help you learn the essential skills of programming in HTML, CSS and jQuery. Two exams will be conducted through the semester in the prac classes. Students who have done CSSE1001 tend to do better on these exams. \u003cbr/\u003e\u003cbr/\u003eA full-scale website will be made individually using the skills learnt in the prac classes. An accompanying document will be made explaining the concept, as well as a reference to the design decisions made. \u003cbr/\u003e\u003cbr/\u003e \tThe final exam will be divided into quizzing on the skills learnt in the practical classes, and concepts learnt in the lectures. The first part of the exam should not be difficult for those who did well in the prac exams. \u003cbr/\u003e\u003cbr/\u003eOverall, this a very well-rounded and interesting course. Code monkeys might be put off by the speeches, documentation and final exam, but they should just suck it up and do the work.\u003cbr/\u003e",
    "coordinator":  "Ms Lorna MacDonald (lorna@itee.uq.edu.au)",
    "contact":  "2L, 1T, 2P",
    "score":  "5",
    "code":  "DECO1400",
    "title":  "Introduction to Web Design",
    "preparation":  "\u003cbr/\u003eitem It may be tempting to skip the lectures, but these form the basis of the final exam. Don\u0027t do it.\u003cbr/\u003eitem Don\u0027t go too overboard with preparing for the tutorial speeches. If you know the topic, it is much easier and more engaging to the audience to ramble on the topic than to memorise paragraphs.\u003cbr/\u003eitem Start the project right away. Even if you don\u0027t know all of the skills to creating the website, at least you are thinking about the design and implementation of the final product.\u003cbr/\u003e",
    "prereq":  "None"
}
