{
    "assessment":  "\u003cbr/\u003eProject Idea \u0026 10% \u0026 A poster explaining your concept \u003cbr/\u003eProject Plan \u0026 20% \u0026 A document explaining the problem space and the concept \u003cbr/\u003eProject Implementation \u0026 15% \u0026 A prototype which demonstrates key interactions of the product \u003cbr/\u003eProject Standup \u0026 15% \u0026 Three fortnightly speeches of the newline progress made on the project worth 5% each\u003cbr/\u003ePromotional Material \u0026 10% \u0026 A poster, video or website explaining the concept to a wider audience \u003cbr/\u003eReflection Essay \u0026 30% \u0026 An essay reflecting on the project and how it links to the lecture topics \u003cbr/\u003e",
    "review":  "\u003cbr/\u003e`Social \u0026 Mobile Computing\u0027 is a course designed to practially apply the skills learnt in DECO2500 to a real project. This involves defining a problem in journalism, and proposing a solution by building a digital prototype. It is required that students will perform usability tests and iterate on their designs from the feedback. \u003cbr/\u003e\u003cbr/\u003eGroups will be formed based on individual posters made on projects ideas. Then, you will work within these groups to produce a concept document within GitHub, a promotional poster or video of the concept, and a high-fidelity prototype. \u003cbr/\u003e\u003cbr/\u003eUnfortunately, this is a very do-it-yourself kind of course. You will be required to construct a plan to carry out the project and the various steps in the design process. Since there is a lot of self-paced group work, don\u0027t be fooled into thinking this is an `easy 7\u0027 course, as there is a lot of room for error. There are three `Standups\u0027, where each group talks to the tutors about their current progress and what work is to be completed.\u003cbr/\u003e\u003cbr/\u003eA large portion of the mark comes from the reflective essay done after the project. This essay outlines your design process, what you learnt when carrying out the design process, and what to do next time. This gives students a taste of constructing a basic research paper, as links to research in the field are required in the document.\u003cbr/\u003e\u003cbr/\u003eWhile the project work is great for any design portfolio, students from this course tend to be left wondering how the lecture material relates to the project work, and how what they learnt in this course can be applied to their own work. If you want to pursue a career in HCI or User Experience Design, then you will find some use for the course material in your career.\u003cbr/\u003e",
    "coordinator":  "Dr Andrew Dekker (a.dekker@uq.edu.au)",
    "contact":  "2L, 2T",
    "score":  "2",
    "code":  "DECO3500",
    "title":  "Social \u0026 Mobile Computing",
    "preparation":  "\u003cbr/\u003e\u003cli\u003e Unfortunately, there is little help from the criteria sheets, and little feedback will be given until the work is marked. Therefore it is essential to ask the tutors and lecturer for clarification on the assessment to do well in this course.\u003cbr/\u003e\u003cli\u003e Organise as many meetings as possible with your group to in order to be up to date with the progress made and what work is to be done. The more meetings you organise, the higher your grades will be.\u003cbr/\u003e\u003cli\u003e Pay at least some attention to the weekly lecture topics. This will be essential to finding research for your reflection document.\u003cbr/\u003e",
    "prereq":  "DECO2500"
}
