{
    "assessment":  "\u003cbr/\u003eProject Part A \u0026 15% \u0026 A document outlining the concept and design \u003cbr/\u003eProject Part B \u0026 15% \u0026 Minimal implementation of the project and a document outlining changes made and group planning \u003cbr/\u003eProject Part C \u0026 30% \u0026 Final design and a document outlining final design decisions and reflection \u003cbr/\u003eDesign Portfolio \u0026 20% \u0026 A full HTML website explaining the project process, the portfolio process, and a course reflection \u003cbr/\u003eReflective Journal \u0026 20% \u0026 A weekly blog of progress made and lessons learned in the course \u003cbr/\u003e",
    "review":  "\u003cbr/\u003eContrary to what you may think, DECO1800 is more of a course which teaches how to work in groups, rather than a course on web design skills. You will be placed into a group of 4 and you will be required to create a website which makes use of the Trove database. Unfortunately, group work projects are a bit of a \u0027dice roll\u0027 in who you are going to get, but this course aims to teach you how to work within groups to create a quality project. In some ways this course is like ENGG2800, but for IT students. The group work emphasis is made evident with the constant documentation and blogging of lessons you have learnt, and suggestions to improve the design process. \u003cbr/\u003e\u003cbr/\u003eThe project will be divided into three parts: The proposal document, the minimum viable product, and the final product. A lot of the mark comes from the accompanying documents, so be prepared to write a lot of words. \u003cbr/\u003e\u003cbr/\u003eYou will also learn how to present your work to a public audience using a mock portfolio. This will involve documenting your design process, and a reflection on the course itself. You may use a bootstrap, but templates are not allowed. \u003cbr/\u003e\u003cbr/\u003eA reflective journal will be required to document the whole project process. It expected that the journal will be updated weekly. Many students loathe the reflective journal, but that is mainly because they underestimate how much work is required to catch up after a month of no updates to their blog. \u003cbr/\u003e\u003cbr/\u003eWhile this course can be a nightmare for those who don\u0027t get a good group, or who don\u0027t know how to work within a group, it is essential for any developer or designer to know the art of compromise and conflict resolution. This course is especially important for aspiring user experience designs who want to build a solid portfolio for employers.\u003cbr/\u003e",
    "coordinator":  "Ms Lorna Macdonald (lorna@itee.uq.edu.au)",
    "contact":  "1L, 4C",
    "score":  "4",
    "code":  "DECO1800",
    "title":  "Design Computing Studio I",
    "preparation":  "\u003cbr/\u003eitem The more meetings you organise with your group, the higher your grades will be. I will repeat that: THE MORE MEETINGS YOU ORGANISE WITH YOUR GROUP, THE HIGHER YOUR GRADES WILL BE.\u003cbr/\u003eitem The reflective journal may seem like a pain, but those who consistently post quality content twice a week will easily get 100% for the journal.\u003cbr/\u003eitem Don\u0027t freak out too much over the portfolio. You don\u0027t need to start right away. If you have a good journal, you will not need to create much content for your portfolio. That being said, make sure you leave at least a week or two to design and implement the website.\u003cbr/\u003e",
    "prereq":  "DECO1400"
}
