{
    "assessment":  "\u003cbr/\u003eAssignment 1 \u0026 25% \u0026 Theory Assignment \u003cbr/\u003eAssignment 2 \u0026 25% \u0026 Group Assignment \u003cbr/\u003eFinal Exam \u0026 50% \u0026 Open book short answer exam \u003cbr/\u003e",
    "review":  "\u003cbr/\u003eThis course provides an overview of the theory of high dimensional databases, with a focus on indexing and searching. This content builds on the theory taught in INFS2200 and it is highly recommended to have taken that course in the past. In short, this course continues to build on the indexing and query planning components of INFS2200.\u003cbr/\u003e\u003cbr/\u003eThe only contact hours for the subject are weekly 2 hour lectures. While attendance is not required, class discussion usually goes on in them, meaning that turning up can be quite beneficial.\u003cbr/\u003e\u003cbr/\u003eThere are 2 assignments with the first being a relatively easy theory assignment and the second being a group assignment. The first assignment is just several theory questions that you must answer, where the second assignment involves choosing a project idea relating to the course content and working on that. Examples of this are data driven software projects powered by a spatial database, or an in-depth theoretical analysis of algorithms that were taught in the course. The final submission for this assignment is a presentation and research report.\u003cbr/\u003e\u003cbr/\u003eThe final exam is open book and can be quite difficult. Even though the theory behind it is fairly simple, the questions require in depth answers that can take a large amount of time to answer. This means that the main challenge in the exam is making small mistakes on rushed answers, rather then trouble with the overall theory.\u003cbr/\u003e\u003cbr/\u003eThis course is strongly recommended to anyone that wants to have a greater understanding with databases, especially building systems that store non traditional data types like points and images.\u003cbr/\u003e",
    "coordinator":  "Prof Xiaofang Zhou (zxf@itee.uq.edu.au)",
    "contact":  "2L",
    "score":  "5",
    "code":  "INFS4205",
    "title":  "Advanced Techniques for High Dimensional Data",
    "preparation":  "\u003cbr/\u003e\u003cli\u003e Have a good understanding of INFS2200 course content, especially the indexing data structures. Basic knowledge of data stuctures and algorithms is also helpful.\u003cbr/\u003e",
    "prereq":  "INFS2200"
}
